https://youtu.be/_VMXD7W2gZc 1주차\
https://youtu.be/3N1eIS9xNI4 2주차\
\
본 파일은 데이터 시각화 2주차 2~6

# W2. 2. Series
# 시리즈 만들기, 인덱스 구조, 원소 선택
## 시리즈 (Series)
### 시리즈 만들기
#### 딕셔너리에서 시리즈로 변환

In [1]:
# -*- coding: utf-8 -*-

# 판다스 불러오기
import pandas as pd

# k:v 구조를 갖는 딕셔너리를 만들고, 변수에 저장
dict_data = {'a': 1, 'b': 2, 'c': 3}

# 판다스 Series()로 딕셔너리를 시리즈로 변환, 변수에 저장
sr = pd.Series(dict_data)

# 변수의 자료형과 저장되어 있는 시리즈 객체를 출력
print(type(sr))
print()
print(sr)

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
dtype: int64

## 인덱스 구조
### - 인덱스 배열 : Series 객체.index
### - 데이터값 배열: Series 객체.index
#### 시리즈 인덱스 01

In [2]:
import pandas as pd

# 리스트를 시리즈로 변환하여 변수에 저장
list_data = ['2021-04-15', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)

0    2021-04-15
1          3.14
2           ABC
3           100
4          True
dtype: object

In [3]:
# 인덱스 배열은 변수1에 저장, 데이터 값 배열은 변수2에 저장
idx = sr.index # 인덱스 배열
val = sr.values # 데이터 값 배열

print(idx)
print('\n')
print(val)

RangeIndex(start=0, stop=5, step=1)


['2021-04-15' 3.14 'ABC' 100 True]

#### 시리즈 인덱스 02

In [4]:
import pandas as pd

# 튜플을 시리즈로 변환( index 옵션에 인덱스 이름을 지정)
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

#### 인덱스 이용해서 원소 선택 시 []안에 인덱스 입력
- 원소 1개 선택

In [5]:
print(sr[0]) # sr의 1번째 원소를 선택 (정수형 위치 인덱스)

영인

In [6]:
print(sr['이름']) # sr의 '이름' 라벨을 가진 원소를 선택 (인덱스 이름)

영인

- 여러 개의 원소를 선택 ( 인덱스 리스트 활용)

In [7]:
print(sr[[1,2]]) # sr의 2, 3번째 원소를 선택 ( 정수형 위치 인덱스)

생년월일    2010-05-01
성별               여
dtype: object

In [8]:
print(sr[['생년월일', '성별']]) # sr의 '생년월일', '성별' 라벨을 가진 원소 선택 (인덱스 이름)

생년월일    2010-05-01
성별               여
dtype: object

#### 여러 개의 원소를 선택 (인덱스 범위 지정)

In [9]:
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [10]:
print(sr[1:2])

생년월일    2010-05-01
dtype: object

In [11]:
print(sr['생년월일':'성별'])

생년월일    2010-05-01
성별               여
dtype: object

# W2. 3-5. Subset_Observations_(Rows)
# 실습 3 Subset_observation(Rows)
https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf
#### drop_duplicates()

In [12]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
{'a': [4,5,6],
'b': [7,8,9],
'c': [10,11,12]},
index = pd.MultiIndex.from_tuples( # 튜플
[('d',1), ('d',2), ('e',2)],
names=['n', 'v']))

In [13]:
type(df) # 타입을 알아봄

pandas.core.frame.DataFrame

In [14]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [15]:
df[df>7]

      a    b   c
n v
d 1 NaN  NaN  10
  2 NaN  8.0  11
e 2 NaN  9.0  12

In [16]:
df[df.b>7] # 'b'에서 7보다 큰 df을 불러옴.

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [17]:
df.b>7 # 조건이기에 bool로 답함

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [18]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [19]:
df[df.c > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [20]:
df[df["c"] > 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [21]:
df["c"] > 7 # 위의 것과 비교. 조건문이기에 bool로 출력

n  v
d  1    True
   2    True
e  2    True
Name: c, dtype: bool

In [22]:
df[df['a'] < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [23]:
df[df['c'] >= 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [24]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

#### drop_duplicates() : 중복된 값 삭제

In [25]:
df.drop_duplicates() # 현재 중복된 값 없음

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [26]:
# 임의로 중복값 생성 

df2 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3)],
        names=['n','v']))
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [27]:
df2.drop_duplicates() # 중복값 삭제. 그러나 inplace=True는 아님. 이어서 보시오.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [28]:
df2  # 어~ 여전히 중복된 값이 남아있네

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [29]:
df2.drop_duplicates(inplace=True) 
# in place of noun: ~을 대신하다 
# python에서 inplace 사용 권장하지 않음 
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [30]:
df2 = df2.drop_duplicates()
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [31]:
# 다시 정의하기
df2 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3)],
        names=['n','v']))
df2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [32]:
df = df.drop_duplicates(keep='last') # 마지막행에 있는 값
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

# 실습 4 Subset_observation(Rows)

## 로직 함수
- &,|,~,^,df.any(),df.all()
- and, or, not, xor, any, all

In [33]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [34]:
df["a"] != 7 # 조건이기에 bool값일 출력함

n  v
d  1    True
   2    True
e  2    True
Name: a, dtype: bool

In [35]:
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [36]:
df[df["b"] != 7] # 7이 아닌 값만 가지고 오고 싶을 때, 7 있는 행은 안가져옴

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [37]:
# df.column.isin(values)
df["a"].isin?
# Use a list of one element instead: values 는 리스트 형태

Object `isin` not found.

- a 컬넘에 원소 5가 포함되어 있는지 확인

In [38]:
df['a'].isin([5]) # 특히, 한글 사용 시 유용

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [39]:
df.a.isin([5]) # a column에 원소 5가 포함되어 있는지 확인

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [40]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [41]:
pd.isnull(df) # null 값이 없다고 확인

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False

In [42]:
# 임의로 null 값 생성 

import numpy as np

df3 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3), ('e',3)],
        names=['n','v']))
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [43]:
pd.isnull(df3) #df3 중 null 값 찾기

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  3   True  False  False

In [44]:
df3['a'].isnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [45]:
df3['a'].isnull().sum()  # null 값의 총 갯수

1

In [46]:
pd.notnull(df3) # 보통 notnull() 많이 씀

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  3  False   True   True

In [47]:
df3.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   3    False
Name: a, dtype: bool

In [48]:
df3.notnull().sum() # df3의 notnull의 총 개수

a    4
b    4
c    4
dtype: int64

In [49]:
df3.any()

a    True
b    True
c    True
dtype: bool

In [50]:
~df3.a.notnull() # 명제에서 배운 ~:아니다

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [51]:
1 and 1 # 교집합 and

1

In [52]:
True and False # dataframe 에서 and  사용 불가

False

In [53]:
df[df3(df3.b == 7) | df3(df3.a == 5)] # df에선 or 연산자 사용불가

TypeError: 'DataFrame' object is not callable

# 실습 5 Subset_observation(Rows)
#### head(), tail() : 처음과 끝 5행

In [54]:
df3

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [55]:
df3.head() # 5행 보여줌

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [56]:
df3.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [57]:
df3.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  3  NaN  9.0  12.0

- sample() 랜덤하게 모델링해서 가져옴
- frac = 0.5 : 50% 비율로 샘플 잡아줘

In [58]:
df3.sample(frac=0.5) # frac(): 일정 비율로 랜덤하게 샘플링해옴, 0.5 비율로

       a    b     c
n v
e 3  NaN  9.0  12.0
d 2  5.0  8.0  11.0

In [59]:
df3.sample(frac=0.7)

       a    b     c
n v
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0
e 3  NaN  9.0  12.0
  3  6.0  9.0   NaN

In [60]:
df3.sample(frac=0.3)

       a    b     c
n v
e 3  NaN  9.0  12.0
d 2  5.0  8.0  11.0

In [61]:
df3.sample(n=10) # 현재 데이터가 5개 밖에 없어서 오류 남

ValueError: Cannot take a larger sample than population when 'replace=False'

In [62]:
df3.sample(n=5)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  NaN  9.0  12.0
d 1  4.0  7.0  10.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

##### sample()과 frac
- 비율로 샘플링 하고 싶다면? frac = 0.xx
- 지정된 횟수, 개수로 샘플링하고 싶다면? n = x

In [63]:
df3 # 원래 df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  3  NaN  9.0  12.0

#### df.iloc[10:20] : select rows by position

In [64]:
df3.iloc[10:20] # 10에서 20까지의 범위에 값이 없기 때문에 출력 값이 없음

Empty DataFrame
Columns: [a, b, c]
Index: []

In [65]:
 df3.iloc[:2] # 0, 1 출력

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [66]:
 df3.iloc[:3]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [67]:
df3.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [68]:
df3.iloc[-2:-1]

       a    b   c
n v
e 3  6.0  9.0 NaN

#### df3.nlargest[n, 'value']

In [69]:
df4 = pd.DataFrame({'a': [1, 10, 8, 11, -1],
                    'b': list('abdce'),
                    'c': [1.0, 2.0, np.nan, 3.0, 4.0]})
df4

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  d  NaN
3  11  c  3.0
4  -1  e  4.0

In [70]:
df4.nlargest(1, 'a') # a 컬럼에서 가장 큰 값만 가지고 오기

    a  b    c
3  11  c  3.0

In [71]:
df4.nlargest(1, 'b') # Type Error 타입에러 발생, 숫자 컬럼에서만 가져올 수 있음

TypeError: Column 'b' has dtype object, cannot use method 'nlargest' with this dtype

In [72]:
df4.nlargest(3, 'c') # 3개 가져오기

    a  b    c
4  -1  e  4.0
3  11  c  3.0
1  10  b  2.0

In [73]:
df.nsmallest(3, 'a')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

# 6. Subset_observation(Columns)

In [74]:
import pandas as pd
import seaborn as sns # iris data 가져오기 위함

In [75]:
df = sns.load_dataset("iris") # 붓꽃 데이터
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [76]:
df[['sepal_width','sepal_length','species']]

     sepal_width  sepal_length    species
0            3.5           5.1     setosa
1            3.0           4.9     setosa
2            3.2           4.7     setosa
3            3.1           4.6     setosa
4            3.6           5.0     setosa
..           ...           ...        ...
145          3.0           6.7  virginica
146          2.5           6.3  virginica
147          3.0           6.5  virginica
148          3.4           6.2  virginica
149          3.0           5.9  virginica

[150 rows x 3 columns]

In [77]:
columns = ['sepal_width','sepal_length','species']
df[columns]  # list 형태로 컬럼을 지정해서 가지고 옴

     sepal_width  sepal_length    species
0            3.5           5.1     setosa
1            3.0           4.9     setosa
2            3.2           4.7     setosa
3            3.1           4.6     setosa
4            3.6           5.0     setosa
..           ...           ...        ...
145          3.0           6.7  virginica
146          2.5           6.3  virginica
147          3.0           6.5  virginica
148          3.4           6.2  virginica
149          3.0           5.9  virginica

[150 rows x 3 columns]

In [78]:
df[columns].head()

   sepal_width  sepal_length species
0          3.5           5.1  setosa
1          3.0           4.9  setosa
2          3.2           4.7  setosa
3          3.1           4.6  setosa
4          3.6           5.0  setosa

In [79]:
df['sepal_width']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [80]:
df['sepal_width']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [81]:
df['sepal_width'].head() # 한글 등 문자가 있을 때 유용

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_width, dtype: float64

In [82]:
df.sepal_width.head()

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_width, dtype: float64

## 정규 표현식
df.filter(regex='regex')

## df.filter(regex='_')  # 언더바가 들어간 컬럼만 가지고 옴

In [84]:
df.filter(regex='lengths$') # Length(대소문자 구분 주의)로 끝나는 문자가 사용된 컬럼만 가져옴

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[150 rows x 0 columns]

In [85]:
df.filter(regex='^sepal') # Sepal로 시작하는 문자가 사용된 컬럼만 가져옴

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [86]:
df.filter(regex='^x[1-5]$') 
# Sepal로 시작하는 문자가 사용된 컬럼만 가져옴 
# Matches strings beginning with 'x' and ending with 1,2,3,4,5

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[150 rows x 0 columns]

In [87]:
df.filter(regex='es$') # es로 끝나는 것

       species
0       setosa
1       setosa
2       setosa
3       setosa
4       setosa
..         ...
145  virginica
146  virginica
147  virginica
148  virginica
149  virginica

[150 rows x 1 columns]

In [88]:
df.filter(regex='^(?!species$).*' ) # Species 제외

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [89]:
df.loc[:,'x2':'x4'] # Select all columns between x2 and x4 (inclusive).

KeyError: 'x2'

In [90]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [91]:
df.loc[2:4] # 2~4행(포함)까지 가져옴

   sepal_length  sepal_width  petal_length  petal_width species
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [92]:
df.loc[2:5,'sepal_width':'petal_width'] # 2~5행(포함), sepal_width~petal_width열(포함)까지 가져옴

   sepal_width  petal_length  petal_width
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2
5          3.9           1.7          0.4

In [93]:
df.iloc[:3,[1,3]] # 3행까지 가져오는데, 1열~3-1행까지 가져옴

   sepal_width  petal_width
0          3.5          0.2
1          3.0          0.2
2          3.2          0.2

In [94]:
df.loc[df['sepal_length'] > 5, ['sepal_length','sepal_width']]
# length값이 5보다 큰 값인 length값과 width값을 가져옴

     sepal_length  sepal_width
0             5.1          3.5
5             5.4          3.9
10            5.4          3.7
14            5.8          4.0
15            5.7          4.4
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[118 rows x 2 columns]

In [95]:
df.loc[df['sepal_length'] > 5, ['sepal_length','sepal_width']].head()

    sepal_length  sepal_width
0            5.1          3.5
5            5.4          3.9
10           5.4          3.7
14           5.8          4.0
15           5.7          4.4

--- seYI